# ws2DelTool

## Description
Workspace advanced APIs. Delete the tool, tool set, or tool palette at the specified menu path. See 'ws2GetMenusCnt'.

```pascal
FUNCTION ws2DelTool(toolPath : DYNARRAY[] of CHAR): BOOLEAN;
```

```python
def vs.ws2DelTool(toolPath):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|toolPath|DYNARRAY[] of CHAR|   |

## Version
Availability: from Vectorworks 2021

## Category
* Workspaces